app/controllers/exercises_controller.rb

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @exercise = Exercise.find_by(id: params[:id])