app/controllers/routines_controller.rb

SELECT "routine_exercises".* FROM "routine_exercises" WHERE "routine_exercises"."exercise_id" = ?  [["exercise_id", 1]]
INSERT INTO "exercises" ("name", "instructions", "rep_time", "muscles", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "routine_exercises" ("routine_id", "exercise_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["routine_id", 1], ["exercise_id", 1], ["created_at", "2017-02-22 18:36:05.773172"], ["updated_at", "2017-02-22 18:36:05.773172"]]
INSERT INTO "routines" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chest Day"], ["created_at", "2017-02-22 18:36:05.757572"], ["updated_at", "2017-02-22 18:36:05.757572"]]
SELECT  "routines".* FROM "routines" WHERE "routines"."user_id" = ?  ORDER BY "routines"."id" DESC LIMIT 1  [["user_id", 1]]
---
  def create
    @routine = Routine.new(routine_params)
    @routine.exercises.each do |exercise|
      exercise.routine_exercises.each do |join|
        join.update(routine: @routine, reps: exercise.reps)
      end
    end
    if @routine.save
      @user.routines << @routine
      redirect_to routine_path(@user.routines.last)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_user
      if current_user
       @user ||= User.find_by(id: current_user.id)

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_routine
      @routine = Routine.find_by(id: params[:id])