app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def edit
    if current_user
      @user = User.find_by(id: current_user.id)

UPDATE "users" SET "height" = ?, "weight" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["height", 67], ["weight", 155], ["updated_at", "2017-02-22 18:30:37.856682"], ["id", 1]]
---
  def update
    redirect_to new_user_session_path unless has_access?
    @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_user
        @user = User.find_by_id(params[:id])