app/views/exercises/_exercise.html.erb

SELECT  "routine_exercises".* FROM "routine_exercises" WHERE "routine_exercises"."exercise_id" = ?  ORDER BY "routine_exercises"."id" DESC LIMIT 1  [["exercise_id", 1]]
---
  <ul>
    <li>Reps: <%=exercise.routine_exercises.last.reps%></li>