app/views/exercises/show.html.erb

SELECT "routines".* FROM "routines" INNER JOIN "routine_exercises" ON "routines"."id" = "routine_exercises"."routine_id" WHERE "routine_exercises"."exercise_id" = ?  [["exercise_id", 2]]
---
<%=render partial: 'exercise', locals: {exercise: @exercise}%>
<% @exercise.routines.each do |routine|%>